In [2]:
import pandas as pd

In [3]:
data=pd.read_csv('house.csv.csv')

In [4]:
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [5]:
data=data.drop(columns=['area_type','availability','society'])

In [6]:
data.head()

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [7]:
data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

In [8]:
data.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [9]:
data=data.drop(['balcony'],axis=1)

In [10]:
data.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [11]:
data.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [13]:
data=data.dropna()

In [14]:
data.shape

(13246, 5)

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13246 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13246 non-null  object
 1   size        13246 non-null  object
 2   total_sqft  13246 non-null  object
 3   bath        13246 non-null  float64
 4   price       13246 non-null  float64
dtypes: float64(2), object(3)
memory usage: 620.9+ KB

In [16]:
data['bhk']=data['size'].apply(lambda x:x.split()[0])

In [17]:
data.head()

                   location       size total_sqft  bath   price bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07   2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00   4
2               Uttarahalli      3 BHK       1440   2.0   62.00   3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00   3
4                  Kothanur      2 BHK       1200   2.0   51.00   2

In [18]:
data=data.drop('size',axis=1)

In [19]:
data.head()

                   location total_sqft  bath   price bhk
0  Electronic City Phase II       1056   2.0   39.07   2
1          Chikka Tirupathi       2600   5.0  120.00   4
2               Uttarahalli       1440   2.0   62.00   3
3        Lingadheeranahalli       1521   3.0   95.00   3
4                  Kothanur       1200   2.0   51.00   2

In [20]:
data.bhk.unique()

array(['2', '4', '3', '6', '1', '8', '7', '5', '11', '9', '27', '10',
       '19', '16', '43', '14', '12', '13', '18'], dtype=object)

In [21]:
data.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [22]:
def is_float(value):
    try:
        float(value)
    except:
        return False
    return True

In [23]:
data[~data['total_sqft'].apply(is_float)].head(10)

               location      total_sqft  bath    price bhk
30            Yelahanka     2100 - 2850   4.0  186.000   4
122              Hebbal     3067 - 8156   4.0  477.000   4
137  8th Phase JP Nagar     1042 - 1105   2.0   54.005   2
165            Sarjapur     1145 - 1340   2.0   43.490   2
188            KR Puram     1015 - 1540   2.0   56.800   2
410             Kengeri  34.46Sq. Meter   1.0   18.500   1
549         Hennur Road     1195 - 1440   2.0   63.770   2
648             Arekere       4125Perch   9.0  265.000   9
661           Yelahanka     1120 - 1145   2.0   48.130   2
672        Bettahalsoor     3090 - 5002   4.0  445.000   4

In [24]:
def convert_sqft_to_num(value):
    tokens = value.split('-')
    if len(tokens) == 2:
        return (float(tokens[0]) + float(tokens[1]))/2
    try:
        return float(value)
    except:
        return None

In [25]:
data['total_sqft']=data['total_sqft'].apply(convert_sqft_to_num)

In [26]:
data.head()

                   location  total_sqft  bath   price bhk
0  Electronic City Phase II      1056.0   2.0   39.07   2
1          Chikka Tirupathi      2600.0   5.0  120.00   4
2               Uttarahalli      1440.0   2.0   62.00   3
3        Lingadheeranahalli      1521.0   3.0   95.00   3
4                  Kothanur      1200.0   2.0   51.00   2

In [27]:
data.total_sqft.unique()

array([1056. , 2600. , 1440. , ..., 1258.5,  774. , 4689. ])

In [28]:
data['price_per_sqft']=data['price']*100000//data['total_sqft']

In [29]:
data.head()

                   location  total_sqft  bath   price bhk  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07   2          3699.0
1          Chikka Tirupathi      2600.0   5.0  120.00   4          4615.0
2               Uttarahalli      1440.0   2.0   62.00   3          4305.0
3        Lingadheeranahalli      1521.0   3.0   95.00   3          6245.0
4                  Kothanur      1200.0   2.0   51.00   2          4250.0

In [30]:
data['location']=data['location'].apply(lambda x:x.strip())

In [31]:
count=data['location'].value_counts()

In [32]:
stats=count<=10

In [33]:
stats

Whitefield                        False
Sarjapur  Road                    False
Electronic City                   False
Kanakpura Road                    False
Thanisandra                       False
                                  ...
Vasantapura main road              True
Bapuji Layout                      True
1st Stage Radha Krishna Layout     True
BEML Layout 5th stage              True
Abshot Layout                      True
Name: location, Length: 1293, dtype: bool

In [34]:
statscount=count[stats]

In [35]:
statscount

Naganathapura                     10
Sadashiva Nagar                   10
Nagappa Reddy Layout              10
BTM 1st Stage                     10
Sector 1 HSR Layout               10
                                  ..
Vasantapura main road              1
Bapuji Layout                      1
1st Stage Radha Krishna Layout     1
BEML Layout 5th stage              1
Abshot Layout                      1
Name: location, Length: 1052, dtype: int64

In [36]:
data['location']=data['location'].apply(lambda x:'other' if x in statscount else x)

In [37]:
data.describe()

         total_sqft          bath         price  price_per_sqft
count  13200.000000  13246.000000  13246.000000    1.320000e+04
mean    1555.302783      2.692586    112.389392    7.920336e+03
std     1237.323445      1.341506    149.076587    1.067272e+05
min        1.000000      1.000000      8.000000    2.670000e+02
25%     1100.000000      2.000000     50.000000    4.267000e+03
50%     1275.000000      2.000000     72.000000    5.438000e+03
75%     1672.000000      3.000000    120.000000    7.317000e+03
max    52272.000000     40.000000   3600.000000    1.200000e+07

In [38]:
data=data[~(data['total_sqft']<300)]

In [39]:
data.describe()

         total_sqft          bath         price  price_per_sqft
count  13189.000000  13235.000000  13235.000000    13189.000000
mean    1556.503885      2.692633    112.420551     6695.078323
std     1237.134699      1.341090    149.123067     4560.994300
min      300.000000      1.000000      9.000000      267.000000
25%     1100.000000      2.000000     50.000000     4266.000000
50%     1275.000000      2.000000     72.000000     5434.000000
75%     1674.000000      3.000000    120.000000     7311.000000
max    52272.000000     40.000000   3600.000000   176470.000000

In [40]:
def remove_pps_outliers(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        reduced_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        df_out = pd.concat([df_out, reduced_df],ignore_index= True)
    return df_out

In [41]:
import numpy as np

In [42]:
data = remove_pps_outliers(data)

In [49]:
def remove_bhk_outliers(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count'] > 5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sqft < stats['mean']].index.values)
    return df.drop(exclude_indices, axis='index')

In [50]:
data.head()

              location  total_sqft  bath  price  bhk  price_per_sqft
0  1st Block Jayanagar      2850.0   4.0  428.0    4         15017.0
1  1st Block Jayanagar      1630.0   3.0  194.0    3         11901.0
2  1st Block Jayanagar      1200.0   6.0  125.0    6         10416.0
3  1st Block Jayanagar      1875.0   2.0  235.0    3         12533.0
4  1st Block Jayanagar       930.0   4.0   85.0    7          9139.0

In [51]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10953 entries, 0 to 10952
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   location        10953 non-null  object
 1   total_sqft      10953 non-null  float64
 2   bath            10953 non-null  float64
 3   price           10953 non-null  float64
 4   bhk             10953 non-null  int64
 5   price_per_sqft  10953 non-null  float64
dtypes: float64(4), int64(1), object(1)
memory usage: 513.6+ KB

In [52]:
data['bhk']=data['bhk'].astype('int64')

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10953 entries, 0 to 10952
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   location        10953 non-null  object
 1   total_sqft      10953 non-null  float64
 2   bath            10953 non-null  float64
 3   price           10953 non-null  float64
 4   bhk             10953 non-null  int64
 5   price_per_sqft  10953 non-null  float64
dtypes: float64(4), int64(1), object(1)
memory usage: 513.6+ KB

In [54]:
data = remove_bhk_outliers(data)

In [55]:
data = data[data.bath<data.bhk+2]

In [56]:
data.head()

              location  total_sqft  bath  price  bhk  price_per_sqft
0  1st Block Jayanagar      2850.0   4.0  428.0    4         15017.0
1  1st Block Jayanagar      1630.0   3.0  194.0    3         11901.0
2  1st Block Jayanagar      1200.0   6.0  125.0    6         10416.0
3  1st Block Jayanagar      1875.0   2.0  235.0    3         12533.0
4  1st Block Jayanagar       930.0   4.0   85.0    7          9139.0

In [57]:
data=data.drop('price_per_sqft',axis=1)

In [58]:
dummies=pd.get_dummies(data.location)

In [59]:
dummies.head()

,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,9th Phase JP Nagar,...,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur,other
0,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [61]:
data=pd.concat([data,dummies.drop('other',axis=1)],axis=1)

In [62]:
data.head()

,location,total_sqft,bath,price,bhk,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,...,Vijayanagar,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur
0,1st Block Jayanagar,2850.0,4.0,428.0,4,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1st Block Jayanagar,1630.0,3.0,194.0,3,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1st Block Jayanagar,1200.0,6.0,125.0,6,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1st Block Jayanagar,1875.0,2.0,235.0,3,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1st Block Jayanagar,930.0,4.0,85.0,7,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [63]:
data=data.drop('location',axis=1)

In [64]:
data.head()

,total_sqft,bath,price,bhk,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,5th Phase JP Nagar,...,Vijayanagar,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur
0,2850.0,4.0,428.0,4,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1630.0,3.0,194.0,3,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1200.0,6.0,125.0,6,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1875.0,2.0,235.0,3,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,930.0,4.0,85.0,7,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [65]:
x=data.drop('price',axis=1)

In [66]:
x.shape

(7752, 244)

In [67]:
y=data.price

In [68]:
from sklearn.model_selection import train_test_split

In [69]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.1,random_state=1)

In [70]:
from sklearn.linear_model import LinearRegression,Lasso,Ridge

In [72]:
reg=LinearRegression()
reg.fit(xtrain,ytrain)

LinearRegression()

In [73]:
reg.score(xtest,ytest)

0.8118958953978477

In [74]:
from sklearn.metrics import r2_score

In [76]:
r2_score(reg.predict(xtest),ytest)

0.7847523955295874

In [77]:
from sklearn.model_selection import cross_val_score,KFold

In [79]:
kv=KFold(n_splits=5,shuffle=True,random_state=42)

In [80]:
score=cross_val_score(reg,x,y,cv=kv)

In [81]:
score

array([0.82617599, 0.84582889, 0.82025213, 0.84304897, 0.781439  ])

In [82]:
a=np.sum(score)/5

In [83]:
a

0.8233489960304441

In [84]:
import pickle as pkl

In [85]:
pkl.dump(reg,open('house.price_predictor','wb'))